{
  "backend/main.mo": "Motoko actor managing user profiles, custom tools, and conversation history with access control and permission checks.",
  "feature_evidence.json": "Report listing implemented features, affected files, components, and test IDs for TTS and browser-support behaviors.",
  "frontend-file-summaries.txt": "Collection of one-line summaries describing the purpose of each frontend file for build reference.",
  "frontend/index.css": "Tailwind base stylesheet defining OKLCH color variables and light/dark theme tokens.",
  "frontend/index.html": "HTML entry point loading the React application root and main.tsx script.",
  "frontend/src/App.tsx": "Main React app component wiring authentication, chat, speech, camera, settings, and TTS logic with history-aware auto-speak.",
  "frontend/src/components/auth/AuthGate.tsx": "Authentication and profile-setup gate that handles login flow and prompts for initial user name.",
  "frontend/src/components/avatar/LiaAvatar.tsx": "Avatar component displaying LIA's idle, listening, or speaking state with corresponding visuals and labels.",
  "frontend/src/components/camera/CameraPanel.tsx": "Camera panel UI that controls starting, stopping, switching, and displaying camera video with error handling.",
  "frontend/src/components/chat/ChatView.tsx": "Chat interface that displays messages, handles input, speech features, and executes commands or tools on send.",
  "frontend/src/components/chat/ClearHistoryButton.tsx": "Button with confirmation dialog to clear all chat history.",
  "frontend/src/components/chat/MessageBubble.tsx": "Renders a single chat message styled differently for user and assistant.",
  "frontend/src/components/onboarding/PermissionCta.tsx": "Full-screen prompt requesting microphone permission with retry handling.",
  "frontend/src/components/settings/SettingsPanel.tsx": "Settings dialog allowing TTS toggling, voice selection, and speech recognition language configuration.",
  "frontend/src/components/tools/ToolManagerPanel.tsx": "Panel to add and list custom tools with form validation and backend integration.",
  "frontend/src/hooks/auth/useCurrentUser.ts": "Hook providing current user identity, auth status, and logout logic.",
  "frontend/src/hooks/chat/useConversationHistory.ts": "Manages local and backend-synced chat history with add and clear functions.",
  "frontend/src/hooks/profile/useCallerUserProfile.ts": "Hook to load and save the caller user's profile information.",
  "frontend/src/hooks/speech/useSpeechRecognition.ts": "Hook wrapping browser speech recognition with state, transcript, and error management.",
  "frontend/src/hooks/speech/useSpeechSynthesis.ts": "Provides a speech synthesis hook that loads voices, selects a preferred voice, restores saved settings, and exposes speak/stop functions.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useFirstRunPermissions.ts": "Checks if microphone permission is needed on first run and handles requesting and retrying permissions.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity provider and hook to manage authentication state, login, and identity persistence.",
  "frontend/src/hooks/useLocalSettings.ts": "Manages local user settings for recognition language, TTS voice, and TTS enablement, persisted in localStorage.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user profiles, tools, and conversation history using the backend actor.",
  "frontend/src/index.css": "Configures Tailwind base styles and defines light/dark theme color variables for the UI.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider and mounts the root component.",
  "frontend/src/tools/builtInTools.ts": "Executes built‑in commands like search, open, YouTube, and help, using web search or opening URLs.",
  "frontend/src/tools/commandParser.ts": "Parses user text into structured commands including built-in and custom tool commands.",
  "frontend/src/tools/customToolRunner.ts": "Runs custom tool commands by building a URL from a template and opening it in a new tab.",
  "frontend/src/tools/webSearch.ts": "Provides a simple web search via DuckDuckGo’s API and returns structured search results.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading URL parameters (including hash routes), storing and retrieving them in sessionStorage, and clearing them from the URL hash.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS with custom colors, typography, container settings, animations, and plugins.",
  "project_state.json": "Defines the project’s state, feature list, and architectural notes for the LIA voice‑assistant application."
}